{
    "generated_code": [
        "",
        "import numpy as np\n# left_force (Calculated rotational force on the left side of the balance scale)\n# Usefulness: This directly implements one half of the rule described in the dataset to determine the class (\"y\"). It represents the torque produced by the weight and distance on the left side, which is crucial for distinguishing between 'left-tip', 'right-tip', and 'balanced'.\n# Input samples: 'left-weight': [np.float64(2.0), np.float64(4.0), np.float64(1.0)], 'left-distance': [np.float64(2.0), np.float64(5.0), np.float64(4.0)]\ndf['left_force'] = df['left-weight'] * df['left-distance']",
        "# right_force (Calculated rotational force on the right side of the balance scale)\n# Usefulness: This directly implements the other half of the rule described in the dataset to determine the class (\"y\"). It represents the torque produced by the weight and distance on the right side, which is essential for distinguishing between 'left-tip', 'right-tip', and 'balanced'.\n# Input samples: 'right-weight': [np.float64(5.0), np.float64(3.0), np.float64(1.0)], 'right-distance': [np.float64(2.0), np.float64(4.0), np.float64(4.0)]\ndf['right_force'] = df['right-weight'] * df['right-distance']",
        "# force_difference (Difference between left and right rotational forces)\n# Usefulness: This feature directly quantifies the imbalance of the scale. A positive value indicates a tendency to tip left, a negative value indicates a tendency to tip right, and a value close to zero indicates balance. This is the core differentiator for the target 'y' according to the dataset description.\n# Input samples: 'left_force': [np.float64(4.0), np.float64(20.0), np.float64(4.0)], 'right_force': [np.float64(10.0), np.float64(12.0), np.float64(4.0)]\ndf['force_difference'] = df['left_force'] - df['right_force']",
        "# left_to_right_force_ratio (Ratio of the rotational force on the left side to the right side)\n# Usefulness: While 'force_difference' indicates the absolute difference, this ratio provides a relative measure of imbalance. A ratio greater than 1 means the left side is stronger, less than 1 means the right side is stronger, and equal to 1 implies balance. This perspective can help the classifier identify balance states, especially when the total force magnitude varies greatly but the proportional balance remains the same.\n# Input samples: 'left_force': [np.float64(4.0), np.float64(20.0), np.float64(4.0)], 'right_force': [np.float64(10.0), np.float64(12.0), np.float64(4.0)]\ndf['left_to_right_force_ratio'] = df['left_force'] / df['right_force']"
    ]
}