{
    "generated_code": [
        "",
        "# left_moment: The product of left-weight and left-distance, representing the rotational force on the left side.\n# Usefulness: This directly corresponds to the \"left-distance * left-weight\" term mentioned in the dataset description for determining the class. This value is critical for predicting whether the scale tips left, right, or is balanced.\n# Input samples: 'left-weight': [np.float64(4.0), np.float64(3.0), np.float64(3.0)], 'left-distance': [np.float64(1.0), np.float64(3.0), np.float64(3.0)]\ndf['left_moment'] = df['left-weight'] * df['left-distance']\n# right_moment: The product of right-weight and right-distance, representing the rotational force on the right side.\n# Usefulness: This directly corresponds to the \"right-distance * right-weight\" term mentioned in the dataset description for determining the class. This value is critical for predicting whether the scale tips left, right, or is balanced.\n# Input samples: 'right-weight': [np.float64(5.0), np.float64(1.0), np.float64(5.0)], 'right-distance': [np.float64(3.0), np.float64(1.0), np.float64(5.0)]\ndf['right_moment'] = df['right-weight'] * df['right-distance']\n# moment_difference: The difference between the left_moment and right_moment.\n# Usefulness: The dataset description explicitly states that the class is determined by \"the greater of (left-distance * left-weight) and (right-distance * right-weight). If they are equal, it is balanced.\" This difference directly quantifies the imbalance and points to which side is heavier, making it a very strong predictor of the target class.\n# Input samples: 'left_moment': [np.float64(4.0), np.float64(9.0), np.float64(9.0)], 'right_moment': [np.float64(15.0), np.float64(1.0), np.float64(25.0)]\ndf['moment_difference'] = df['left_moment'] - df['right_moment']",
        "# is_balanced: A boolean indicator of whether the left and right rotational moments are equal.\n# Usefulness: This feature directly encodes the condition for the \"balanced\" class as specified in the dataset description (\"If they are equal, it is balanced.\"). By providing an explicit binary flag, it helps the Random Forest classifier to precisely identify and differentiate 'balanced' instances from 'tips left' or 'tips right', which is crucial for achieving high accuracy, especially in the one-vs-one AUC where 'balanced' vs 'left' and 'balanced' vs 'right' comparisons are made.\n# Input samples: 'left_moment': [np.float64(4.0), np.float64(9.0), np.float64(9.0)], 'right_moment': [np.float64(15.0), np.float64(1.0), np.float64(25.0)]\ndf['is_balanced'] = (df['left_moment'] == df['right_moment'])"
    ]
}