{
    "generated_code": [
        "\n# (Total number of bathrooms)\n# Usefulness: The total number of bathrooms is a significant factor in determining house value. Combining full and half baths from both the basement and above grade provides a comprehensive measure of a home's convenience and capacity, which directly correlates with its price.\n# Input samples: {'BsmtFullBath': [1, 1, 0], 'BsmtHalfBath': [0, 0, 0], 'FullBath': [1, 2, 1], 'HalfBath': [0, 1, 0]}\ndf['TotalBath'] = df['FullBath'] + 0.5 * df['HalfBath'] + df['BsmtFullBath'] + 0.5 * df['BsmtHalfBath']\n\n# (Total square footage of the house)\n# Usefulness: The total living area is one of the most critical predictors of a house's price. This feature combines the above-grade living area with the total basement area to give a complete picture of the house's size.\n# Input samples: {'GrLivArea': [1144, 2520, 1520], 'TotalBsmtSF': [864, 1338, 793]}\ndf['TotalSF'] = df['GrLivArea'] + df['TotalBsmtSF']\n\n# (Age of the house at the time of sale)\n# Usefulness: The age of a house is a key determinant of its value, reflecting factors like depreciation, architectural style, and potential need for repairs. Newer houses generally command higher prices.\n# Input samples: {'YrSold': [2009, 2006, 2009], 'YearBuilt': [1961, 1993, 1932]}\ndf['HouseAge'] = df['YrSold'] - df['YearBuilt']\n\n# (Age of the remodel at the time of sale)\n# Usefulness: This feature captures how recently a house was remodeled. A recent remodel can significantly increase a property's value, making this a stronger predictor than just the original construction year. A value of 0 indicates a remodel in the year of sale.\n# Input samples: {'YrSold': [2009, 2006, 2009], 'YearRemodAdd': [1983, 1993, 2000]}\ndf['RemodelAge'] = df['YrSold'] - df['YearRemodAdd']\n\n# (Total square footage of all porch areas)\n# Usefulness: Porches add to the usable outdoor living space of a home. A larger total porch area can increase a home's appeal and, consequently, its market value.\n# Input samples: {'OpenPorchSF': [0, 55, 0], 'EnclosedPorch': [0, 0, 56], '3SsnPorch': [0, 0, 0], 'ScreenPorch': [0, 0, 0]}\ndf['TotalPorchSF'] = df['OpenPorchSF'] + df['EnclosedPorch'] + df['3SsnPorch'] + df['ScreenPorch']\n\n# (Combined overall quality and condition score)\n# Usefulness: This interaction feature amplifies the effect of both overall quality and condition. A house with high quality and in good condition will have a much higher score, likely correlating strongly with a higher sale price, compared to a house that is good in only one of these aspects.\n# Input samples: {'OverallQual': [5, 8, 5], 'OverallCond': [6, 7, 5]}\ndf['OverallQualCond'] = df['OverallQual'] * df['OverallCond']\n\n# (Binary feature indicating if the house was ever remodeled)\n# Usefulness: A simple flag for whether a remodel has occurred can be a powerful signal. It indicates that an investment has been made to update the property, which typically increases its value.\n# Input samples: {'YearBuilt': [1961, 1993, 1932], 'YearRemodAdd': [1983, 1993, 2000]}\ndf['IsRemodeled'] = (df['YearRemodAdd'] > df['YearBuilt']).astype(int)\n\n# (Ratio of above-grade living area to the total lot area)\n# Usefulness: This ratio provides insight into land usage. A higher ratio means a larger house relative to the yard, which could be positive or negative depending on buyer preferences and neighborhood context. It helps the model understand the balance between indoor and outdoor space.\n# Input samples: {'GrLivArea': [1144, 2520, 1520], 'LotArea': [10000, 14541, 4500]}\ndf['LivArea_LotArea_Ratio'] = df['GrLivArea'] / (df['LotArea'] + 1e-6)\n\n# (Ratio of bathrooms to total rooms above grade)\n# Usefulness: This feature can indicate the convenience and modernity of a house's layout. A higher ratio of bathrooms to rooms is often found in more modern or higher-end homes, which can be a positive price indicator.\n# Input samples: {'TotalBath': [2.0, 4.0, 1.0], 'TotRmsAbvGrd': [6, 10, 6]}\ndf['Bath_per_Room'] = df['TotalBath'] / (df['TotRmsAbvGrd'] + 1e-6)\n\n# (Total number of rooms including basement)\n# Usefulness: While TotRmsAbvGrd is useful, it ignores finished basement space. This feature attempts to create a more holistic room count. Assuming a finished basement adds roughly 2-3 rooms on average. This is an approximation but can capture the value of a finished basement more effectively.\n# Input samples: {'TotRmsAbvGrd': [6, 10, 6], 'BsmtFinSF1': [594, 1012, 182], 'BsmtFinSF2': [0, 0, 0]}\ndf['TotalRms'] = df['TotRmsAbvGrd'] + (df['BsmtFinSF1'] > 0).astype(int) + (df['BsmtFinSF2'] > 0).astype(int)\n\n"
    ]
}